app/Controllers/CategoriaController.php

    public function store()
    {
        $data = [
            'nombre'        => $this->request->getPost('nombre'),
            'descripcion'   => $this->request->getPost('descripcion'),
            'status'        => $this->request->getPost('status')
        ];

        $this->categoriaModel->insert($data);
---
INSERT INTO `categorias` (`nombre`, `descripcion`, `status`, `created_at`, `updated_at`) VALUES ('Prueba final', 'asfhjvdj', '0', '2023-12-11 00:51:02', '2023-12-11 00:51:02')