app/Controllers/ProductoController.php

    public function store()
    {
        $data = [
            'sku'        => $this->request->getPost('sku'),
            'nombre_producto'   => $this->request->getPost('nombre_producto'),
            'nombre_corto'        => $this->request->getPost('nombre_corto'),
            'descripcion' => $this->request->getPost('descripcion'),
            'imagen' => $this->request->getPost('imagen'),
            'precio_venta' => $this->request->getPost('precio_venta'),
            'precio_compra' =>$this->request->getPost('precio_compra')

        ];

        $this->productoModel->insert($data);
---
INSERT INTO `productos` (`sku`, `nombre_producto`, `nombre_corto`, `descripcion`, `imagen`, `precio_venta`, `precio_compra`, `created_at`, `updated_at`) VALUES ('2', 'Prueba final', 'PR F', 'Esta es la prueba final', 'Ninguna', '150', '75', '2023-12-11 00:51:40', '2023-12-11 00:51:40')